Enums/СтатусыПроизводственныхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыПроизводственныхОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Формируется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Создана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВыполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пропущена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыПроизводственныхОпераций/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Перечень рабочих статусов производственной операции
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.СтатусыПроизводственныхОпераций
Функция Рабочие() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить(Перечисления.СтатусыПроизводственныхОпераций.Создана);
	Результат.Добавить(Перечисления.СтатусыПроизводственныхОпераций.Выполняется);
	Результат.Добавить(Перечисления.СтатусыПроизводственныхОпераций.Выполнена);
	Результат.Добавить(Перечисления.СтатусыПроизводственныхОпераций.НеВыполнена);
	Результат.Добавить(Перечисления.СтатусыПроизводственныхОпераций.Пропущена);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
